Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The amount of tension to apply (default is 2).
zh_cn: 要应用的张力量(默认值为 2)。

source: The animated vector drawable definition refers to the groups and paths in the vector drawable by their names:
zh_cn: animated vector drawable 定义根据其名称引用 vector drawable 中的组和路径：

source: The animation XML file belongs in the res/anim/ directory of your Android project.
zh_cn: 动画 XML 文件属于 Android 项目的 res/anim/ 目录。

source: The animation definitions represent ObjectAnimator or AnimatorSet objects.
zh_cn: 动画定义代表 ObjectAnimator 或 AnimatorSet 对象。

source: The animation framework automatically handles color values
zh_cn: 动画框架自动处理颜色值

source: The animation framework automatically handles color values.
zh_cn: 动画框架自动处理颜色值。

source: The animation instructions define the transformations that you want to occur, when they will occur, and how long they should take to apply.
zh_cn: 动画指令定义要发生的转换、转换将在何时发生以及转换应用所需的时间。

source: The app that defines the custom permission must be installed before the app that uses it.
zh_cn: 定义自定义权限的应用程序必须在使用它的应用程序之前安装。

source: The barrier is set to the "end" (or the right side in a left-to-right layout) of both view A and view B. So the barrier moves depending on whether the right side of view A or view B is is farthest right.
zh_cn: 屏障设置在视图 A 和视图 B 的“end”(或从左到右布局中的右侧)。因此屏障的移动取决于视图 A 或视图 B 的右侧，哪一个是最右侧。

source: The benefits, as small as they might seem, are multiplied several times because this layout is used for every item in a list.
zh_cn: 这些好处虽然看起来很小，但却成倍增加，因为这个布局用于列表中的每一项。

source: The broadcast message is wrapped in an Intent object.
zh_cn: 广播消息包装在 Intent 对象中。

source: The broadcast message itself is wrapped in an Intent object whose action string identifies the event that occurred (for example android.intent.action.AIRPLANE_MODE).
zh_cn: 广播消息本身包装在一个 Intent 对象中，该对象的 action 字符串标识发生的事件(例如 android.Intent.action.AIRPLANE_MODE)。

source: The broadcast receiver in the following example logs and displays the contents of the broadcast:
zh_cn: 以下示例中的广播接收器记录并显示广播的内容：

source: The calculations take into account the view's padding.
zh_cn: 计算考虑了 view 的 padding。

source: The call to fling() sets up the physics model for the fling gesture.
zh_cn: 对 fling() 的调用设置了投掷手势的物理模型。

source: The chain's "head" view (the left-most view in a horizontal chain and the top-most view in a vertical chain) defines the chain's style in XML.
zh_cn: 链的 '头部' view(水平链中最左侧的 view 和垂直链中最顶部的 view)在 XML 中定义为链的样式。

source: The change bounces at the end.
zh_cn: 变化在结束处反弹。

source: The change flings forward and overshoots the last value, then comes back.
zh_cn: 变化向前跳，超出最后一个值，然后返回。

source: The change in the target value results in a change in force.
zh_cn: 目标值的变化导致力的变化。

source: The change starts backward then flings forward.
zh_cn: 变化开始向后，然后向前。

source: The change starts backward, flings forward and overshoots the target value, then settles at the final value.
zh_cn: 变化从后开始，向前抛出并超出目标值，然后稳定在最终值。

source: The class is defined with the following line:
zh_cn: 该类使用以下行定义：

source: The code example below shows how to animate moving a single button to the bottom of the screen.
zh_cn: 下面的代码示例演示如何设置将单个按钮移动到屏幕底部的动画。

source: The custom component is created as a generic view in the XML, and the class is specified using the full package.
zh_cn: 该自定义组件在 XML 中被视为一个通用的 view 创建，并且这个类要使用完整的包名。

source: The deceleration rate (default is 1).
zh_cn: 减速率(默认为 1)。

source: The default evaluator to calculate values for float properties.
zh_cn: 用于计算 float 属性值的默认求值器。

source: The default evaluator to calculate values for int properties.
zh_cn: 用于计算 int 属性值的默认求值器。

source: The default evaluator to calculate values for color properties that are represented as hexadecimal values.
zh_cn: 用于计算以十六进制值表示的颜色属性值的默认求值器。

source: The default is set to refresh every 10 ms, but the speed in which your application can refresh frames is ultimately dependent on how busy the system is overall and how fast the system can service the underlying timer.
zh_cn: 默认设置为每 10 毫秒刷新一次，但应用程序刷新帧的速度最终取决于系统整体的繁忙程度以及系统为底层计时器提供服务的速度。

source: The default length is 300 ms.
zh_cn: 默认长度为 300 毫秒。

source: The default maximum depth is 10.
zh_cn: 默认的最大深度为 10。

source: The default value for this attribute is false.
zh_cn: 该属性的缺省值是 false。

source: The default value for this attribute is true.
zh_cn: 该属性的缺省值是 true。

source: The default value is "0", which means no repetition.
zh_cn: 默认值为 "0"，表示不重复。

source: The documentation for each of these classes describes in more detail how they impact the overall life-cycle of their application.
zh_cn: 这些类的文档更详细地描述了它们如何影响应用程序的整个生命周期。

source: The drawable to use for this frame.
zh_cn: 用于此帧的 drawable。

source: The drawback is that ValueAnimator is not available prior to API level 11, so this technique cannot be used on devices running Android versions lower than 3.0.
zh_cn: 缺点是在 API 级别 11 之前 ValueAnimator 不可用，因此该技术不能用于运行低于 3.0 的 Android 版本的设备。

source: The duration of the animation is set to 40 ms and the distance to travel is 40 pixels.
zh_cn: 动画的持续时间设置为 40 毫秒，移动距离为 40 像素。

source: The duration to show this frame, in milliseconds.
zh_cn: 显示此帧的持续时间(毫秒)。

source: The editor shows view C below A, but it has no vertical constraint
zh_cn: 编辑器显示 A 下面的 view C，但没有垂直约束

source: The effect is most visible when the view size is set to "fixed" or "wrap content," in which case the view is centered between the constraints.
zh_cn: 当 view 大小设置为 "Fixed" 或 "Wrap Content" 时，效果最明显，在这种情况下 view 在约束之间居中。

source: The elapsed fraction represents the percentage of time that the animation has completed, 0 meaning 0% and 1 meaning 100%.
zh_cn: 经过的分数表示动画完成的时间百分比，0 表示 0%，1 表示 100%。

source: The entire feature-set of the Android OS is available to you through APIs written in the Java language.
zh_cn: Android 操作系统的整个特性集都可以通过用 Java 语言编写的 API 获得。

source: The exact policy of ordering on this list is an implementation detail of the platform, but generally it will try to keep more useful processes (one hosting the user's home application, the last activity they saw, etc) before other types of processes.
zh_cn: 在这个列表上进行排序的确切策略是平台的实现细节，但通常它会尝试在其他类型的进程之前保留更多有用的进程(用户 home 应用程序的宿主、他们看到的最后一个 activity 等)。

source: The file must have a single root element: either <set>, <objectAnimator>, or <valueAnimator>.
zh_cn: 该文件必须具有一个根元素：<set>，<objectAnimator> 或 <valueAnimator>。

source: The file must have a single root element: either an <alpha>, <scale>, <translate>, <rotate>, or <set> element that holds a group (or groups) of other animation elements (even nested <set> elements).
zh_cn: 文件必须有一个根元素：一个 <alpha>，<scale>，<translate>，<rotate>，或 <set> 元素，它包含一组(或多组)其他动画元素(甚至嵌套 <set> 元素)。

source: The file must have a single root element: this will be either a single <alpha>, <scale>, <translate>, <rotate>, interpolator element, or <set> element that holds groups of these elements (which may include another <set>).
zh_cn: 文件必须有一个根元素：这将是一个单独的 <alpha>，<scale>，<translate>，<rotate>，interpolator 元素，或者是保存这些元素组的 <set> 元素(其中可能包括另一个 <set>)。

source: The filename will be used as the resource ID.
zh_cn: 文件名将被用作资源 ID。

source: The first and last view are affixed to the constraints on each end of the chain and the rest are evenly distributed.
zh_cn: 第一个和最后一个 view 被附加到链的每个端部上的约束，并且其余的是均匀分布的。

source: The first animator in this example rotates the target group 360 degrees:
zh_cn: 本例中的第一个动画将目标组旋转 360 度：

source: The first option is to use an Animation Drawable.
zh_cn: 第一种选择是使用一个 Animation Drawable。

source: The following ViewStub is for a translucent progress bar overlay.
zh_cn: 下面的 ViewStub 用于半透明进度条覆盖。

source: The following XML from one of the ApiDemos is used to stretch, then simultaneously spin and rotate a View object.
zh_cn: 下面一个 ApiDemos 中的 XML 用于拉伸，然后同时旋转和旋转视图对象。

source: The following code shows how to do this:
zh_cn: 下面的代码演示如何做到这一点：

source: The following code snippet demonstrates how to send a broadcast by creating an Intent and calling sendBroadcast(Intent).
zh_cn: 下面的代码片段演示如何通过创建 intent 并调用 sendBroadcast(Intent) 来发送广播。

source: The following diagram shows the major components of the Android platform.
zh_cn: 下图显示了 Android 平台的主要组成部分。

source: The following sections describe how to use both methods.
zh_cn: 以下各节介绍如何使用这两种方法。

source: The following snippet shows a BroadcastReceiver that uses goAsync() to flag that it needs more time to finish after onReceive() is complete.
zh_cn: 下面的代码片段显示了一个 BroadcastReceiver，它使用 goAsync() 来标记在完成 onReceive() 之后需要更多时间才能完成。

source: The following snippet shows how PieChart exposes a property called showText:
zh_cn: 以下代码段显示 PieChart 如何公开名为 showText 的属性：

source: The following subclasses extend Animator:
zh_cn: 以下子类扩展 Animator：

source: The following table specifies the resource to use for each interpolator:
zh_cn: 下表指定用于每个插值的资源：

source: The following tables describe the main components of the property animation system.
zh_cn: 下表描述了属性动画系统的主要组件。

source: The foundation of the Android platform is the Linux kernel.
zh_cn: Android 平台的基础是 Linux 内核。

source: The framework animates the views at runtime by changing some of their property values over time.
zh_cn: 框架在运行时通过随时间更改视图的某些属性值来设置视图的动画。

source: The framework includes built-in animations for common effects and lets you create custom animations and transition lifecycle callbacks.
zh_cn: 该框架包括用于公共效果的内置动画，并允许你创建自定义动画和过渡生命周期回调。

source: The getter and setter much match a specific pattern.
zh_cn: getter 和 setter 非常匹配特定的模式。

source: The helper method resolveSizeAndState() is used to create the final width and height values.
zh_cn: 辅助方法 resolveSizeAndState() 用于创建最终的宽度和高度值。

source: The implementation is much more efficient (no interprocess communication needed) and you don't need to worry about any security issues related to other apps being able to receive or send your broadcasts.
zh_cn: 该实现效率更高(不需要进程间通信)，而且你不必担心与其他应用程序能够接收或发送广播相关的任何安全问题。

source: The information can be read by any app that registers to receive the broadcast.
zh_cn: 任何注册接收广播的应用程序都可以读取该信息。

source: The intent filters specify the broadcast actions your receiver subscribes to.
zh_cn: intent 过滤器指定接收器订阅的广播操作。

source: The intent may also include additional information bundled into its extra field.
zh_cn: intent 还可以包括捆绑到其 extra 字段中的附加信息。

source: The intent's action string must provide the app's Java package name syntax and uniquely identify the broadcast event.
zh_cn: intent 的操作字符串必须提供应用程序的 Java 包名称语法，并唯一标识广播事件。

source: The main timing engine for property animation that also computes the values for the property to be animated.
zh_cn: 属性动画的主计时引擎，它还计算要设置动画的属性的值。

source: The menu to convert a layout to ConstraintLayout
zh_cn: 将一个布局转换为 ConstraintLayout 的菜单

source: The most common input event in the Android system is touch, which triggers onTouchEvent(android.view.MotionEvent).
zh_cn: Android 系统中最常见的输入事件是 touch，它触发 onTouchEvent(android.view.MotionEvent)。

source: The most generic view you can extend is, unsurprisingly, View, so you will usually start by extending this to create your new super component.
zh_cn: 不出意料的，你可以继承的最通用的 view 是 View 所以通常情况你会从继承这个类开始创建你的组件。

source: The most important part of a custom view is its appearance.
zh_cn: 自定义 view 最重要的部分是它的外观。

source: The most important step in drawing a custom view is to override the onDraw() method.
zh_cn: 绘制自定义 view 最重要的步骤是覆盖 onDraw() 方法。

source: The name of the styleable entity is, by convention, the same name as the name of the class that defines the custom view.
zh_cn: 按照惯例，styleable 实体的名称与定义自定义 view 的类的名称相同。

source: The namespace for broadcast actions is global.
zh_cn: 广播操作的命名空间是全局的。

source: The nested LinearLayout serves no real purpose other than to slow down your UI performance.
zh_cn: 嵌套的 LinearLayout 除了降低用户界面的性能外，没有任何实际用途。

source: The new force applies on the existing velocity, which makes a continuous transition to the new target.
zh_cn: 新的力应用于现有的速度，这使得向新目标连续过渡。

source: The next section deals with retrieving and applying the values at runtime.
zh_cn: 下一节将介绍如何在运行时获取和应用值。

source: The next section discusses Paint in more detail.
zh_cn: 下一节将更详细地讨论 Paint。

source: The number of cycles (default is 1).
zh_cn: 周期的数目(默认值为 1)。

source: The number of these processes running in the system is less bounded than foreground processes, but still relatively controlled.
zh_cn: 在系统中运行的这些进程的数量比前台进程的限制要小，但仍然是相对可控的。

source: The object still moves 40 pixels in 40 ms, but non-linearly.
zh_cn: 这个物体在 40 毫秒内仍然会移动 40 个像素，但是是非线性的。

source: The object's property to animate, referenced by its name.
zh_cn: 要设置动画的对象的属性，由其名称引用。

source: The offset is defined by the constrained view's margin.
zh_cn: 偏移由被约束的 view 的 margin 定义。

source: The only difference is that your custom attributes belong to a different namespace.
zh_cn: 唯一的区别是你的自定义属性属于不同的命名空间。

source: The only limit is your imagination and what you need the component to do.
zh_cn: 唯一的限制就是你的想象力和你需要组件干什么。

source: The only reason to keep such a process around is as a cache to improve startup time the next time a component of its application needs to run.
zh_cn: 保留这样一个进程的唯一原因是作为一个缓存，以便在其应用程序的组件下次需要运行时提高启动时间。

source: The only time you should return false from onDown() is if you truly want to ignore an entire gesture.
zh_cn: 你应该从 onDown() 返回 false 的唯一时间是如果你真的想要忽略整个手势。

source: The order receivers run in can be controlled with the android:priority attribute of the matching intent-filter; receivers with the same priority will be run in an arbitrary order.
zh_cn: 可以使用匹配 intent 过滤器的 android:priority 属性控制接收器的运行顺序；具有相同优先级的接收器将以任意顺序运行。

source: The other attribute you must provide is based on the value type.
zh_cn: 必须提供的另一个属性基于值类型。

source: The other attributes and parameters in the definition are the ones passed into the custom component constructor, and then passed through to the EditText constructor, so they are the same parameters that you would use for an EditText view.
zh_cn: 定义的其他属性和参数会传递到自定义组件的构造方法中，然后再传给 EditText 的构造方法，所以和 EditText 使用的参数相同。

source: The overridden onMeasure() method is called with width and height measure specifications (widthMeasureSpec and heightMeasureSpec parameters, both are integer codes representing dimensions) which should be treated as requirements for the restrictions on the width and height measurements you should produce.
zh_cn: 重写的 onMeasure() 方法调用时会传递宽高的测量规格。(widthMeasureSpec 和 heightMeasureSpec 参数，两者都是整型表示的尺寸)，宽高的测量规格应该被视为你计算的宽高测量结果的限制。

source: The parameter to onDraw() is a Canvas object that the view can use to draw itself.
zh_cn: onDraw() 的参数是一个 Canvas 对象，view 可用于绘制自身。

source: The property animation system is a robust framework that allows you to animate almost anything.
zh_cn: 属性动画系统是一个健壮的框架，允许你对几乎所有内容进行动画。

source: The property animation system is also more robust in the way it carries out animation.
zh_cn: 属性动画系统在执行动画的方式上也更加健壮。

source: The property animation system lets you define the following characteristics of an animation:
zh_cn: 属性动画系统允许你定义动画的以下特征：

source: The property animation system provides the following evaluators:
zh_cn: 属性动画系统提供以下求值器：

source: The rate of change follows a sinusoidal pattern.
zh_cn: 变化率遵循正弦曲线。

source: The rate of change is constant.
zh_cn: 变化的速度是恒定的。

source: The rate of change starts and ends slowly but accelerates through the middle.
zh_cn: 变化的速度开始和结束都很慢，但从中间加速。

source: The rate of change starts out quickly, then decelerates.
zh_cn: 变化的速度开始很快，然后减速。

source: The rate of change starts out slowly, then accelerates.
zh_cn: 变化的速度开始缓慢，然后加速。

source: The receiver does not receive broadcasts from sources outside of the app.
zh_cn: 接收器不接收来自应用程序外部源的广播。

source: The receiver then becomes a separate entry point into your app which means that the system can start the app and deliver the broadcast if the app is not currently running.
zh_cn: 然后接收器成为应用程序的单独入口点，这意味着如果应用程序当前未运行，系统可以启动该应用程序并发送广播。

source: The receiver's host process becomes only as important as the other app components that are running in it.
zh_cn: 接收器的宿主进程只会变得和运行在其中的其他应用程序组件一样重要。

source: The root View should be exactly how you'd like it to appear in each layout to which you add this layout.
zh_cn: 根 View 应该正好是你希望它在添加此布局的每个布局中的显示方式。

source: The second animator in this example morphs the vector drawable's path from one shape to another.
zh_cn: 本例中的第二个动画将 vector drawable 的路径从一个形状变形到另一个形状。

source: The second form should parse and apply any attributes defined in the layout file.
zh_cn: 第二种形式应该解析并应用所有在布局文件中定义的属性。

source: The second option is to use an Animated Vector Drawable, which lets you animate the properties of a vector drawable.
zh_cn: 第二个选择是使用一个 Animated Vector Drawable，它可以让你动画一个 Vector Drawable 的属性。

source: The sections below explain how to create custom Views and use them in your application.
zh_cn: 下面的章节将介绍如何创建自定义的 View 并在应用中使用它们。

source: The solution to this problem is to start a Service from the BroadcastReceiver, so the system knows that there is still active work being done in the process.
zh_cn: 解决此问题的方法是从广播接收器启动 Service，以便系统知道此进程中仍有活动工作正在进行。

source: The solution to this problem is typically to schedule a JobService from the BroadcastReceiver, so the system knows that there is still active work being done in the process.
zh_cn: 解决此问题的方法通常是从广播接收器调度一个 JobService，以便系统知道此进程中仍有活动工作正在进行。

source: The starting and ending layout are each stored in a Scene, though the starting scene is usually determined automatically from the current layout.
zh_cn: 开始和结束布局都存储在 Scene 中，尽管开始场景通常由当前布局自动确定。

source: The state of your BroadcastReceiver (whether it is running or not) affects the state of its containing process, which can in turn affect its likelihood of being killed by the system.
zh_cn: BroadcastReceiver 的状态(它是否正在运行)会影响其包含进程的状态，进而影响其被系统杀死的可能性。

source: The super.onDraw() method is called before the method ends.
zh_cn: super.onDraw() 方法在方法结束前被调用。

source: The superclass method should be invoked, and in this case, we do it at the end after we have painted the lines we want to include.
zh_cn: 应该调用超类方法，在这种情况下，我们在绘制了要包含的行之后最后执行它。

source: The superclass methods to override start with 'on', for example, onDraw(), onMeasure(), and onKeyDown().
zh_cn: 父类要重写的方法以 'on' 开头，比如 onDraw()、onMeasure()、onKeyDown() 等等。

source: The system apps function both as apps for users and to provide key capabilities that developers can access from their own app.
zh_cn: 系统应用程序既可以作为用户的应用程序，也可以提供开发人员可以从自己的应用程序访问的关键功能。

source: The system automatically sends broadcasts when various system events occur, such as when the system switches in and out of airplane mode.
zh_cn: 当各种系统事件发生时，例如当系统切换到飞行模式和退出飞行模式时，系统自动发送广播。

source: The system creates a new BroadcastReceiver component object to handle each broadcast that it receives.
zh_cn: 系统创建一个新的 BroadcastReceiver 组件对象来处理其接收到的每个广播。

source: The system keeps the process running except under cases of extreme memory pressure.
zh_cn: 系统保持进程运行，除非在极端内存压力的情况下。

source: The system package manager registers the receiver when the app is installed.
zh_cn: 安装应用程序时，系统包管理器会注册接收器。

source: The system restricts the broadcast to the set of apps that match the package.
zh_cn: 系统将广播限制为与包匹配的应用程序集。

source: The time in milliseconds of the animation.
zh_cn: 动画的时间(毫秒)。

source: The toolbar's Margin button.
zh_cn: 工具栏的 Margin 按钮。

source: The traffic lights on each block represent its Measure, Layout and Draw performance, helping you identify potential issues.
zh_cn: 每个块上红绿灯代表其测量、布局和绘制性能，帮助你识别潜在问题。

source: The usual starting point is a Layout of some kind, so create a class that extends a Layout.
zh_cn: 通常需要从某种类型的的 Layout 开始，所以创建一个继承 Layout 的类。

source: The value must be a reference to a resource that specifies an interpolator (not an interpolator class name).
zh_cn: 该值必须是对指定插值器(而不是插值器类名)的资源的引用。

source: The value where the animated property ends.
zh_cn: 动画属性结束的值。

source: The value where the animated property starts.
zh_cn: 动画属性开始的值。

source: The value where the animation ends.
zh_cn: 动画结束的值。

source: The value where the animation starts.
zh_cn: 动画开始的值。

source: The view animation framework supports both tween and frame by frame animations, which can both be declared in XML.
zh_cn: view 动画框架支持补间动画和帧动画，这两种动画都可以用 XML 声明。

source: The view animation system is also constrained in the fact that it only exposes a few aspects of a View object to animate, such as the scaling and rotation of a View but not the background color, for instance.
zh_cn: 视图动画系统也受到限制，因为它只支持要设置动画的 view 对象的几个方面，例如视图的缩放和旋转，而不支持背景色。

source: The view animation system provides the capability to only animate View objects, so if you wanted to animate non-View objects, you have to implement your own code to do so.
zh_cn: 视图动画系统仅提供了对 View 对象设置动画的能力，因此如果要对非 View 对象设置动画，则必须实现自己的代码。

source: The view animation system, however, takes less time to setup and requires less code to write.
zh_cn: 然而，视图动画系统的设置时间更短，并且需要编写的代码更少。

source: The view changes its background color as it moves.
zh_cn: 视图在移动时更改其背景色。

source: The view expands as much as possible to meet the constraints on each side (after accounting for the view's margins).
zh_cn: 视图尽可能扩展以满足每一侧的约束(在考虑视图的边距之后)。

source: The view expands only as much as needed to fit its contents.
zh_cn: 视图仅根据需要扩展以适合其内容。

source: The view inspector indicates which is set as a ratio by connecting the corresponding edges with a solid line.
zh_cn: 视图检查器通过用实线链接相应的边来指示设置为比率。

source: The view is set to a 16:9 aspect with the width based on a ratio of the height.
zh_cn: view 设置为 16：9，宽度基于高度的比率。

source: The views are evenly distributed (after margins are accounted for).
zh_cn: view 均匀分布(在考虑边距之后)。

source: The views are packed together (after margins are accounted for).
zh_cn: view 被打包在一起(在考虑边距之后)。

source: The views within a chain can be distributed either vertically or horizontally.
zh_cn: 链中的视图可以垂直或水平分布。

source: Then click on the text baseline and drag the line to another baseline.
zh_cn: 然后单击文本基线并将该线拖动到另一个基线。

source: Then the system figures out and executes an animation between the two layouts.
zh_cn: 然后系统计算出并执行两个布局之间的动画。

source: Then you can set up the other views to use within your new component; this is where you would create the EditText field and the PopupList.
zh_cn: 然后就可以设置在新的组件中要使用 view，这里就应该创建 EditText 和 PopupList。

source: Then, to be able to send broadcasts to those receivers, the sending app must request the permission as shown below:
zh_cn: 然后，要向这些接收器发送广播，发送应用程序必须请求如下所示的权限：

source: There are default interpolator resources available from the platform or you can create your own interpolator resource.
zh_cn: 平台上有默认的插值器资源，也可以创建自己的插值器资源。

source: There are three important things to note in this code:
zh_cn: 此代码中有三个重要事项需要注意：

source: There are three ways to control who can receive your broadcasts:
zh_cn: 有三种方法可以控制谁可以接收你的广播：

source: There are three ways to limit the broadcasts that your app receives:
zh_cn: 有三种方法可以限制应用程序接收的广播：

source: There are two pieces to animating properties: calculating the animated values and setting those values on the object and property that is being animated.
zh_cn: 设置属性动画有两个部分：计算动画值和设置正在设置动画的对象和属性的值。

source: There are two types of animations that you can do with the view animation framework:
zh_cn: 使用视图动画框架可以执行两种类型的动画：

source: There are two ways to do this:
zh_cn: 有两种方法可以做到这一点：

source: There is a form of the constructor that are called when the view is created from code and a form that is called when the view is inflated from a layout file.
zh_cn: 有一种形式的构造方法是在用代码创建 view 时被调用，另一种形式是在 view 从资源文件中加载时调用。

source: There is an even easier option for creating a custom View which is useful in certain circumstances.
zh_cn: 在某些情况下，创建自定义 View 有一种更简单的选择。

source: There will only ever be a few such processes in the system, and these will only be killed as a last resort if memory is so low that not even these processes can continue to run.
zh_cn: 系统中只有少数这样的进程，如果内存太低，甚至这些进程都无法继续运行，这些进程将作为最后手段被终止。

source: These APIs form the building blocks you need to create Android apps by simplifying the reuse of core, modular system components and services, which include the following:
zh_cn: 通过简化核心、模块化系统组件和服务的重用，这些 API 构成了创建 Android 应用程序所需的构建块，这些组件和服务包括：
